app/controllers/users_controller.rb

INSERT INTO "users" ("email", "username", "password_digest", "role", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        user = User.create(userParams)

SELECT "users".* FROM "users" WHERE (username = 'wilam' OR email = 'ruef@gmal.com') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def login
        sql = "username = :username OR email = :email"
        user = User.where(sql, {username: userParams[:username], email: userParams[:email]}).first