api/app/controllers/application_controller.rb

        def user_session
            user_id = session[:user_id]
            puts "session[:user_id] = #{user_id.inspect}"
            User.find(user_id.to_i)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]