api/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
    def user
        user = User.find_by(id: session[:uid])