api/app/controllers/incidents_controller.rb

    def index
      incidents = Incident.all
---
SELECT "incidents".* FROM "incidents"

    def create
      incident = Incident.new(incident_params)
      if incident.save
---
INSERT INTO "incidents" ("title", "description", "status", "date", "location", "latitude", "longitude", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def show
      incident = user.incidents.find_by(id: params[:id])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."user_id" = $1 AND "incidents"."id" = $2 LIMIT $3  [["user_id", 36], ["id", 3], ["LIMIT", 1]]

    def destroy
      incident = user.incidents.find_by(id: params[:id])
      if incident
        incident.destroy
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "incidents" WHERE "incidents"."id" = $1  [["id", 4]]