api/app/controllers/incidents_controller.rb

    def create
    incident = Incident.create(incident_params)
---
INSERT INTO "incidents" ("title", "description", "user_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

def destroy
    Incident.find(params[:id]).destroy
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]