api/app/controllers/users_controller.rb

    def create
        user = User.create(userParams)
---
INSERT INTO "users" ("email", "username", "password_digest", "role", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"