api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        #get users
        render json: User.all, status: :ok

INSERT INTO "users" ("email", "username", "password_digest", "role", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "kiptoo@gmail.com"], ["LIMIT", 1]]
---
    def login
        sql = "username = :username OR email = :email"
        user = User.where(sql, { username: user_params[:username], email: user_params[:email] }).first