api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username = 'mathai') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def login

        sql = "username = :username"
        user = User.where(sql, {username: user_params[:username]}).first